{
  "title": "California State University Information Security Policy",
  "policy_id": "CSU-IT-001",
  "category": "IT & Security",
  "effective_date": "2024-01-15",
  "last_updated": "2024-07-15",
  "sections": {
    "purpose": {
      "title": "Purpose and Scope",
      "content": "This policy establishes information security requirements for all California State University (CSU) campuses, employees, students, contractors, and third parties who access CSU information systems. The policy aims to protect the confidentiality, integrity, and availability of CSU information assets while ensuring compliance with federal and state regulations."
    },
    "definitions": {
      "title": "Definitions",
      "content": {
        "Information Asset": "Any data, information system, or technology resource owned, operated, or used by the CSU.",
        "Sensitive Information": "Information that requires protection due to legal, regulatory, contractual, or business requirements, including but not limited to personally identifiable information (PII), protected health information (PHI), financial data, and academic records.",
        "Information System": "Any combination of hardware, software, networks, and data used to collect, filter, process, create, store, or communicate information.",
        "Authorized User": "Any individual who has been granted legitimate access to CSU information systems and data."
      }
    },
    "password_requirements": {
      "title": "Password and Authentication Requirements",
      "content": {
        "minimum_length": "Passwords must be at least 12 characters long",
        "complexity": "Passwords must contain a combination of uppercase letters, lowercase letters, numbers, and special characters",
        "expiration": "Passwords must be changed every 90 days for privileged accounts and every 180 days for standard user accounts",
        "reuse": "Users cannot reuse their last 12 passwords",
        "multi_factor": "Multi-factor authentication (MFA) is required for all administrative accounts and recommended for all user accounts",
        "storage": "Passwords must not be stored in plain text or shared with others"
      }
    },
    "data_classification": {
      "title": "Data Classification and Handling",
      "content": {
        "public": "Information that can be freely shared without risk to the CSU",
        "internal": "Information intended for use within the CSU community",
        "confidential": "Sensitive information that could cause harm if disclosed inappropriately",
        "restricted": "Highly sensitive information requiring the highest level of protection",
        "handling_requirements": "All data must be classified according to its sensitivity level and handled according to established procedures. Confidential and restricted data must be encrypted both in transit and at rest."
      }
    },
    "incident_response": {
      "title": "Security Incident Response",
      "content": {
        "reporting": "All suspected security incidents must be reported immediately to the campus IT Security Office and the CSU Information Security Office",
        "response_time": "Initial response to security incidents must begin within 2 hours of detection",
        "documentation": "All security incidents must be documented with details of the incident, response actions taken, and lessons learned",
        "notification": "Affected parties and regulatory bodies must be notified according to legal and policy requirements"
      }
    },
    "access_control": {
      "title": "Access Control and User Management",
      "content": {
        "principle": "Access to information systems and data must be granted based on the principle of least privilege",
        "authorization": "All access must be authorized by the appropriate data owner or system administrator",
        "review": "User access rights must be reviewed at least annually and immediately upon role changes or termination",
        "guest_access": "Guest and temporary access must be limited in scope and duration with appropriate oversight"
      }
    },
    "compliance": {
      "title": "Compliance and Enforcement",
      "content": {
        "requirements": "All CSU community members must comply with this policy and related procedures",
        "training": "Security awareness training is required annually for all users",
        "violations": "Policy violations may result in disciplinary action, including termination of employment or academic dismissal",
        "monitoring": "CSU reserves the right to monitor information systems for security and compliance purposes"
      }
    }
  },
  "related_policies": [
    "CSU Acceptable Use Policy",
    "CSU Privacy Policy", 
    "CSU Data Governance Policy",
    "CSU Incident Response Procedures"
  ],
  "contact_information": {
    "policy_owner": "CSU Information Security Office",
    "email": "security@calstate.edu",
    "phone": "(562) 951-4700"
  }
}
